package main
import "fmt"


// 打印1到100之间所有是9的倍数的整数的个数和总和


func main() {
	// 循环100之间所有9的倍数
	var num int
	var sum int
	for i := 0; i <= 100; i++{
		if i % 9 == 0{
			fmt.Println(i)
			num ++
			sum += i
		}
	}
	fmt.Printf("总共有%d个9的倍数 \n", num)
	fmt.Printf("9的倍数总和为%d \n", sum)

	// 打印一个99乘法表
	for i := 1; i <= 9; i++{
		for j := 1; j <= i; j++{
			fmt.Printf("%d * %d = %d	", j, i, i*j)
		}
		fmt.Println("")  // Println是自带换行符的，他的意思就是输出一行
	}

}







0
9
18
27
36
45
54
63
72
81
90
99
总共有12个9的倍数 
9的倍数总和为594 
1 * 1 = 1	
1 * 2 = 2	2 * 2 = 4	
1 * 3 = 3	2 * 3 = 6	3 * 3 = 9	
1 * 4 = 4	2 * 4 = 8	3 * 4 = 12	4 * 4 = 16	
1 * 5 = 5	2 * 5 = 10	3 * 5 = 15	4 * 5 = 20	5 * 5 = 25	
1 * 6 = 6	2 * 6 = 12	3 * 6 = 18	4 * 6 = 24	5 * 6 = 30	6 * 6 = 36	
1 * 7 = 7	2 * 7 = 14	3 * 7 = 21	4 * 7 = 28	5 * 7 = 35	6 * 7 = 42	7 * 7 = 49	
1 * 8 = 8	2 * 8 = 16	3 * 8 = 24	4 * 8 = 32	5 * 8 = 40	6 * 8 = 48	7 * 8 = 56	8 * 8 = 64	
1 * 9 = 9	2 * 9 = 18	3 * 9 = 27	4 * 9 = 36	5 * 9 = 45	6 * 9 = 54	7 * 9 = 63	8 * 9 = 72	9 * 9 = 81	
[Finished in 0.7s]
